using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.UI;

public class TextScript : MonoBehaviour {

    public string[] chapter1 = {
        "あるところに白オバケがいました。",
		"白オバケは甘いものが大好きでした。",
        "森の中にお菓子をたくさんもらえる屋敷がある。",
        "そう聞いた白オバケは早速、カゴを持ち森へ行きました。",
		"続く"
    };

    public string[] chapter2 = {
        "白オバケが森に着くと、屋敷に続く道に黒い影があります。",
        "白オバケは不思議に思って、そっと近づいてみました。",
		"影は、町外れに住んでいる黒オバケでした。",
		"黒オバケはみんなから嫌われているオバケです。",
		"白オバケが見ていると、黒オバケはどこかに行ってしまいました。",
		"続く"
    };
	public string[] chapter3 = {
		"白オバケが道を進むと、ようやく屋敷が見つかりました。",
		"大きな扉をあけて、白オバケは家の中を探します。",
		"どこにお菓子があるんだろう。あっ、あの部屋かな。",
		"いちばん大きな扉の部屋から、甘い匂いが漂ってきています。",
		"白オバケは勢いよく扉を開けました。",
		"続く"
	};
	public string[] chapter4 = {
	    "部屋の中はとても素敵な場所でした。",
		"様々な種類のお菓子が山のようにあるのです。",
		"白オバケは夢中になってお菓子を集めました。",
		"続く"
	};
	public string[] chapter5 = {
		"カゴがいっぱいになり、白オバケは部屋を出ました。",
		"せっかくだからもうちょっとこの家を見ていこう。",
		"白オバケはそう考えて探検をはじめました。",
		"続く"
	};
	public string[] chapter6 = {
		"全ての部屋を回って、白オバケは探検を終わらせました。",
		"そして、白オバケが帰ろうとした時です。",
		"いきなり、何かが白オバケにぶつかりました。",
		"転んだ白オバケが起きると、なんとカゴがありません。",
		"白オバケは、ぶつかってきた何かの後を追います。",
		"続く"
	};
	public string[] chapter7 = {
		"何かは、お菓子のある部屋に入って行きました。",
		"白オバケも急いで部屋に入ります。",
		"部屋に入るとそこにいたのは黒オバケでした。" ,
		"黒オバケの手には、白オバケのカゴがあります。",
		"続く"
	};
	public string[] chapter8 = {
		"僕のお菓子を返してよ！",
		"やるもんか！この家の物は全部僕のだ！",
		"白オバケは勢いよく黒オバケの方に走って行きした。",
		"黒オバケが驚いている間に白オバケはカゴを取り返しました。",
		"白オバケは急いで部屋を出ようとします。",
		"続く"
	};
	public string[] chapter9 = {
		"黒オバケは白オバケの後を追いかけ、捕まえようとします。",
		"その時、黒オバケはつまづいて転んでしまいました。",
		"そのすきに白オバケは急いで屋敷を出ました。",
		"白オバケが家に着くと、なんと黒オバケがやってきました。",
		"続く"
	};
	public string[] chapter10 = {
		"えっと、さっきはごめんなさい！君のお菓子が美味しそうだったから…",
		"もう気にしてないよ！君も怪我は無かった？",
		"うん！その、あのね？僕と友達になってくれませんか？",
		"もちろんいいよ！さあ、家に入ってよ。一緒にお菓子を食べよう！",
		"そして二人は、それから友達として過ごして行きました。",
		"終わり"
	};
}
